# ReverseIterator Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
CurveArrArray..::..ReverseIterator Method
CurveArrArray Class See Also
---
Retrieve a backward moving iterator to the array.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual CurveArrArrayIterator ReverseIterator()
```

Visual Basic
---
```text
Public Overridable Function ReverseIterator As CurveArrArrayIterator
```

Visual C++
---
```text
public:
virtual CurveArrArrayIterator^ ReverseIterator()
```

# ### Return Value
Returns a backward moving iterator to the array.
# See Also
CurveArrArray Class
Autodesk.Revit.DB Namespace